tap "appleboy/tap"
tap "barnardb/cookies"
tap "carlocab/personal"
tap "charmbracelet/tap"
tap "danvergara/tools"
tap "homebrew/bundle"
tap "homebrew/cask", "git@github.com:Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "localsend/localsend"
tap "noborus/tap"
tap "ringohub/redis-cli"
tap "sunnyyoung/repo"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
tap "vangie/formula"
tap "ybeapps/sourcegit"
tap "zackelia/formulae"
tap "zurawiki/brews"
brew "libpng"
brew "xz"
brew "zstd"
brew "gettext"
brew "readline"
brew "aria2"
brew "asciinema"
brew "autojump"
brew "axel"
brew "bat"
brew "btop"
brew "cairo"
brew "ccat"
brew "certifi"
brew "cryptography"
brew "certbot"
brew "cheat"
brew "chezmoi"
brew "chsrc"
brew "cmake"
brew "dust"
brew "duti"
brew "eza"
brew "fd"
brew "p11-kit"
brew "libass"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gdu"
brew "gh"
brew "gibo"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-ignore"
brew "git-lfs"
brew "glfw"
brew "glm"
brew "gnu-sed"
brew "go"
brew "helix"
brew "lua"
brew "highlight"
brew "hub"
brew "jq"
brew "just"
brew "libmagic"
brew "libomp"
brew "libuv"
brew "lnav"
brew "lrzsz"
brew "lsd"
brew "lux"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "openconnect"
brew "osx-cpu-temp"
brew "p7zip"
brew "pinentry-mac"
brew "pkgconf"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "swig"
brew "ta-lib"
brew "tailspin"
brew "tcl-tk"
brew "telnet"
brew "tesseract-lang"
brew "thefuck"
brew "timg"
brew "tldr"
brew "trash", link: true
brew "tree"
brew "trzsz", link: false
brew "trzsz-go"
brew "tssh"
brew "uv"
brew "vhs"
brew "viu"
brew "websocat"
brew "wget"
brew "xcodegen"
brew "xh"
brew "yazi"
brew "you-get"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "appleboy/tap/codegpt"
brew "barnardb/cookies/cookies"
brew "carlocab/personal/unrar"
brew "charmbracelet/tap/freeze"
brew "danvergara/tools/dblab"
brew "ringohub/redis-cli/redis-cli"
brew "tsonglew/dutis/dutis"
cask "android-file-transfer"
cask "android-platform-tools"
cask "bobhelper"
cask "cheatsheet"
cask "clash-verge-rev"
cask "cursor"
cask "dozer"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-noto-color-emoji"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "insomnia"
cask "itsycal"
cask "localsend"
cask "lulu"
cask "microsoft-edge"
cask "openinterminal"
cask "orbstack"
cask "pearcleaner"
cask "pot"
cask "proxyman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sfm"
cask "sourcegit"
cask "syntax-highlight"
cask "todesk"
cask "warp"
cask "wechattweak-cli"
cask "windsurf"
cask "zed"
