tap "appleboy/tap"
tap "barnardb/cookies"
tap "carlocab/personal"
tap "charmbracelet/tap"
tap "danvergara/tools"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask", "git@github.com:Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "localsend/localsend"
tap "noborus/tap"
tap "ringohub/redis-cli"
tap "sunnyyoung/repo"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
tap "vangie/formula"
tap "zackelia/formulae"
tap "zurawiki/brews"
brew "libpng"
brew "xz"
brew "zstd"
brew "gettext"
brew "readline"
brew "aria2"
brew "autojump"
brew "axel"
brew "bat"
brew "btop"
brew "cairo"
brew "catimg"
brew "ccat"
brew "certifi"
brew "cryptography"
brew "certbot"
brew "cheat"
brew "chezmoi"
brew "chsrc"
brew "cmake"
brew "duti"
brew "eza"
brew "fcrackzip"
brew "fd"
brew "p11-kit"
brew "libass"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gdu"
brew "gh"
brew "gibo"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-lfs"
brew "glfw"
brew "glm"
brew "gnu-sed"
brew "go"
brew "helix"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "just"
brew "libmagic"
brew "libuv"
brew "lnav"
brew "lrzsz"
brew "lsd"
brew "lux"
brew "m-cli"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "nushell"
brew "openconnect"
brew "osx-cpu-temp"
brew "p7zip"
brew "pinentry-mac"
brew "pkg-config"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "rye"
brew "shellcheck"
brew "shfmt"
brew "swig"
brew "tailspin"
brew "telnet"
brew "thefuck"
brew "tldr"
brew "trash"
brew "tree"
brew "trzsz", link: false
brew "trzsz-go"
brew "tssh"
brew "uv"
brew "vhs"
brew "websocat"
brew "wget"
brew "xh"
brew "you-get"
brew "yt-dlp"
brew "appleboy/tap/codegpt"
brew "barnardb/cookies/cookies"
brew "carlocab/personal/unrar"
brew "charmbracelet/tap/freeze"
brew "danvergara/tools/dblab"
brew "noborus/tap/ov"
brew "ringohub/redis-cli/redis-cli"
brew "tsonglew/dutis/dutis"
cask "android-file-transfer"
cask "android-platform-tools"
cask "background-music"
cask "buzz"
cask "cakebrew"
cask "clash-verge-rev"
cask "dozer"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "fsnotes"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "insomnia"
cask "lapce"
cask "localsend"
cask "lulu"
cask "markedit"
cask "microsoft-edge"
cask "onlyoffice"
cask "openinterminal"
cask "orbstack"
cask "pot"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sfm"
cask "syntax-highlight"
cask "todesk"
cask "typora"
cask "v2rayu"
cask "warp"
cask "wechattweak-cli"
cask "zed"
vscode "akamud.vscode-theme-onedark"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "danielsanmedium.dscodegpt"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "huntertran.auto-markdown-toc"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jaimeolivares.yuml"
vscode "jakebathman.mysql-syntax"
vscode "lextudio.restructuredtext"
vscode "marp-team.marp-vscode"
vscode "matthewpi.caddyfile-support"
vscode "mkhl.shfmt"
vscode "monish.regexsnippets"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pnp.polacode"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "skellock.just"
vscode "spywhere.guides"
vscode "swyddfa.esbonio"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "trond-snekvik.simple-rst"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
